<template>
  <el-card header="EHC-HR-12-04 假期管理规定:">
  三天（不含）以下的休假由部门经理及主管批准，三天（含）以上须部门副总裁批准；部门主管、经理及以上人员申请休假须由其上级主管批准。
  <pre>三天（不含）以下的休假须提前一天申请，三天（含）以上十天（不含）以下的须提前7天申请，十天（含）以上的休假须提前一个月申请并须提前一周报备人力资源部。</pre>
    <pre>若遇特殊情况，有突发事件无法提前申请，必须在得知突发事件当时先电话与其主管口头请假，并于回公司上班后立即填写正式申请单，获得所须批准签字后报送人力资源部。</pre>  
<pre>请假开始和结束时间请统一按公司规定上班时间（8:30-12:00, 13:00-17:30）填写。</pre>
<pre>CS等部门需要上夜班的员工，可以把夜班时间换算成白天时间来填写，而在 Reason 一栏中注明实际的夜班请假时间。</pre>
</el-card> 
</template>

<script setup></script>

<style lang="scss" scoped></style>
